tap "charmbracelet/tap"
tap "ublue-os/tap"
tap "valkyrie00/bbrew"
# Email client that runs in your terminal
brew "aerc"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Preexec and precmd functions for Bash (like Zsh)
brew "bash-preexec"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Load/unload environment variables based on $PWD
brew "direnv"
# Linux utility to get information on filesystems, like df but better
brew "dysk"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Sound system for POSIX OSes
brew "pulseaudio"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# GitHub command-line tool
brew "gh"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# Post-modern modal text editor
brew "helix"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Library for USB device access
brew "libusb-compat"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Stress test a computer system in various selectable ways
brew "stress-ng"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils"
# Pager/text based browser
brew "w3m"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
# Command-line interface for 1Password
cask "1password-cli"
# Password manager that keeps all passwords secure behind one password
cask "ublue-os/tap/1password-gui-linux"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-nerd-font"
# Open-source code editor
cask "ublue-os/tap/visual-studio-code-linux"
vscode "anthropic.claude-code"
vscode "dollspace-gay.chainlink-issue-tracker"
vscode "github.copilot-chat"
vscode "kdl-org.kdl"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mvllow.rose-pine"
flatpak "app.devsuite.Ptyxis"
flatpak "com.bambulab.BambuStudio"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.PintaProject.Pinta"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.heroicgameslauncher.hgl"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.obsproject.Studio"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.spotify.Client"
flatpak "com.valvesoftware.Steam"
flatpak "com.vivaldi.Vivaldi"
flatpak "com.yubico.yubioath"
flatpak "de.leopoldluley.Clapgrep"
flatpak "dev.vencord.Vesktop"
flatpak "dev.zed.Zed"
flatpak "io.freetubeapp.FreeTube"
flatpak "io.github.celluloid_player.Celluloid"
flatpak "io.github.diegopvlk.Cine"
flatpak "io.github.flattool.Ignition"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.getnf.embellish"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.github.prateekmedia.pstube"
flatpak "io.github.ronniedroid.concessio"
flatpak "io.github.softfever.OrcaSlicer", remote: "orcaslicer-origin"
flatpak "io.gitlab.adhami3310.Impression"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.mpv.Mpv"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "md.obsidian.Obsidian"
flatpak "me.iepure.devtoolbox"
flatpak "net.lutris.Lutris"
flatpak "org.audacityteam.Audacity"
flatpak "org.freedesktop.Bustle"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Connections"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.FileRoller"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Fractal"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.Showtime"
flatpak "org.gnome.SimpleScan"
flatpak "org.gnome.Snapshot"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.dspy"
flatpak "org.gnome.font-viewer"
flatpak "org.kde.haruna"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "org.pipewire.Helvum"
flatpak "org.qbittorrent.qBittorrent"
flatpak "org.signal.Signal"
flatpak "org.zotero.Zotero"
flatpak "page.tesk.Refine"
flatpak "us.zoom.Zoom"
